{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Qwen2ForCausalLM",
    "parent_library": "transformers.models.qwen2.modeling_qwen2"
  },
  "base_model_name_or_path": "Qwen/Qwen2.5-0.5B",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 2,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}